# HasObjStoryBounds

## Description
Determine if the object has any story bounds.

```pascal
FUNCTION HasObjStoryBounds(object : HANDLE) : BOOLEAN;
```

```python

def vs.HasObjStoryBounds(object):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object.|

## Returns
Return TRUE if the object has any story bounds. Otherwise - FALSE.

## See Also
VS Functions:
HasObjStoryBounds| HasObjStoryBound| GetObjStoryBound| SetObjectStoryBound| DelObjStoryBounds| DelObjStoryBound| GetObjStoryBoundsCnt| GetObjStoryBoundsAt

## Version
Availability: from Vectorworks 2012
## Category
* Objects - Architectural